"""

Домашнее задание №1

Цикл 

* Ввести с клавиатуры строку.
* Вывести эту же строку вертикально: по одному символу на строку консоли.
"""

def main():
    string = input ('Введите строку\n')
    for i in string :
      print (i)

if __name__ == "__main__":
    main()
